{"name":"du","desc":"The \"du\" command is a commonly used command in Linux/Unix systems that is used to view the disk space occupied by a directory or file.","usages":[{"form":{"":{"type":"string","name":"The path of the file or directory"},"-h":{"type":"check","name":"Prints the file size in human-readable format.","optionName":"-h"},"-B":{"type":"select","name":"Displays the file size in the specified block size","options":[{"value":"KB","name":"KB"},{"value":"MB","name":"MB"},{"value":"GB","name":"GB"},{"value":"TB","name":"TB"},{"value":"PB","name":"PB"},{"value":"EB","name":"EB"},{"value":"ZB","name":"ZB"},{"value":"YB","name":"YB"},{"value":"K","name":"K"},{"value":"M","name":"M"},{"value":"G","name":"G"},{"value":"T","name":"T"},{"value":"P","name":"P"},{"value":"E","name":"E"},{"value":"Z","name":"Z"},{"value":"Y","name":"Y"}],"optionName":"-B"},"-a":{"type":"check","name":"Prints all files and directories, including hidden files.","optionName":"-a"},"-b":{"type":"check","name":"Displays the file size in bytes.","optionName":"-b"},"-c":{"type":"check","name":"Displays the total size of the directory.","optionName":"-c"},"-d":{"type":"string","name":"Sets the depth of the directory to be displayed.","optionName":"-d"},"-k":{"type":"check","name":"Displays the file size in kilobytes.","optionName":"-k"},"-L":{"type":"check","name":"Follows symbolic links.","optionName":"-L"},"-s":{"type":"check","name":"Displays only the total size of each directory.","optionName":"-s"}}}],"content":"<h2 id=\"example\">Example</h2>\n<ul>\n<li><code>du</code>: View the disk space usage of all files and subdirectories in the current directory.</li>\n<li><code>du -h</code>: View the disk space usage of all files and subdirectories in the current directory in a human-readable format.</li>\n<li><code>du -s</code>: View the disk space usage of the current directory, excluding subdirectories.</li>\n<li><code>du -a</code>: View the disk space usage of all files and subdirectories in the current directory, including hidden files.</li>\n<li><code>du -c</code>: View the disk space usage of all files and subdirectories in the current directory and display the total size.</li>\n<li><code>du -d N</code>: View the disk space usage of all files and subdirectories at a depth of N in the current directory.</li>\n<li><code>du -b</code>: View the disk space usage of all files and subdirectories in the current directory in bytes.</li>\n</ul>\n<p>You can specify a directory to view the disk space usage of all files and subdirectories in that directory by adding the directory name after the command. For example: <code>du /var/log</code>.</p>\n<p>Note that the <code>du</code> command will recursively calculate the size of all files and subdirectories in a directory, which may be time-consuming. If you only want to view the size of files and subdirectories in a specific directory, it is recommended to use the <code>-d</code> parameter to limit the depth and improve the command execution efficiency.</p>\n"}