{"name":"ls","desc":"ls is a commonly used command line instruction used to display a list of contents in a directory. It can also display detailed information about files and directories, such as file type, access permissions, owner, and more.","usages":[{"form":{"":{"type":"string","name":"File or directory path or expression","required":true},"-a":{"type":"check","name":"List all files and directories, including hidden files and directories.","optionName":"-a"},"-l":{"type":"check","name":"Display detailed information on files and directories in long format.","optionName":"-l"},"-h":{"type":"check","name":"Display file and directory size in a human-readable format.","optionName":"-h"},"-r":{"type":"check","name":"List files and directories in reverse order.","optionName":"-r"},"-t":{"type":"check","name":"Sort and display files and directories by modification time.","optionName":"-t"},"-S":{"type":"check","name":"Sort and display files and directories by size.","optionName":"-S"},"-R":{"type":"check","name":"Recursively display the contents of all subdirectories.","optionName":"-R"},"-d":{"type":"check","name":"Display the directory itself instead of its contents.","optionName":"-d"},"-F":{"type":"check","name":"Append a character to the end of the file name to indicate its type.","optionName":"-F"},"-i":{"type":"check","name":"Display the iNode number of files and directories.","optionName":"-i"},"-s":{"type":"check","name":"Display the size of files and directories in blocks.","optionName":"-s"},"-u":{"type":"check","name":"Sort and display files and directories by access time.","optionName":"-u"},"-c":{"type":"check","name":"Sort and display files and directories by change time.","optionName":"-c"},"-m":{"type":"check","name":"Separate the names of files and directories with commas.","optionName":"-m"},"-1":{"type":"check","name":"Only display one file or directory per line.","optionName":"-1"},"--help":{"type":"check","name":"Display help information for the command.","optionName":"--help"}}}],"content":"<h2 id=\"example\">Example</h2>\n<ul>\n<li><code>ls</code>: Show files and directories in the current directory.</li>\n<li><code>ls -l</code>: Show files and directories in the current directory with their attributes and permissions displayed in detail.</li>\n<li><code>ls -a</code>: Show all files and directories in the current directory, including hidden files and directories.</li>\n<li><code>ls -al</code>: Show all files and directories in the current directory, including hidden files and directories, with their attributes and permissions displayed in detail.</li>\n<li><code>ls /path/to/directory</code>: Show files and directories in the specified directory.</li>\n<li><code>ls *.txt</code>: Show all files in the current directory with the extension <code>.txt</code>.</li>\n<li><code>ls -lh</code>: Show files and directories in the current directory in a human-readable format, with file size displayed in bytes.</li>\n</ul>\n"}