{"name":"traceroute","desc":"traceroute is a network diagnostic tool used to determine the path that a packet takes from the source computer to the target computer. It does so by sending packets and recording the time and path of their return. traceroute can help network administrators identify network bottlenecks and faults.","usages":[{"form":{"":{"name":"Target Computer","required":true,"type":"string"},"-I":{"type":"check","name":"Use ICMP echo instead of UDP packets","group":"1","optionName":"-I"},"-T":{"type":"check","name":"Use TCP SYN packets instead of UDP packets","group":"1","optionName":"-T"},"-U":{"type":"check","name":"Use UDP packets instead of ICMP echo","group":"1","optionName":"-U"},"-a":{"type":"check","name":"Print address and port number","optionName":"-a"},"-c":{"type":"string","name":"Set the number of packets to be sent","optionName":"-c"},"-f":{"type":"string","name":"Set the initial TTL value","optionName":"-f"},"-m":{"type":"string","name":"Set the maximum TTL value","optionName":"-m"},"-n":{"type":"check","name":"Do not resolve IP addresses to hostnames","optionName":"-n"},"-p":{"type":"string","name":"Set the port number","optionName":"-p"},"-q":{"type":"string","name":"Set the maximum number of requests per address","optionName":"-q"},"-r":{"type":"check","name":"Use route tracing instead of ICMP echo request","optionName":"-r"},"-s":{"type":"string","name":"Set the size of packets to be sent","optionName":"-s"},"-t":{"type":"string","name":"Set the ICMP timeout","optionName":"-t"},"-w":{"type":"string","name":"Set the timeout for each reply","optionName":"-w"}}}],"content":"<h2 id=\"additional-information\">Additional Information</h2>\n<p>In the traceroute command, the -n option is used to disable reverse DNS lookups on IP addresses. When using traceroute, it will attempt to resolve IP addresses to hostnames by default so that hostnames can be displayed while tracing the route path. This can help identify particular nodes in a network. However, if you only care about IP addresses and not hostnames, you can use the -n option to disable reverse DNS lookups.</p>\n<p>The traceroute command with the -n option will display IP addresses directly without any reverse DNS lookups. This may be more useful in certain situations, particularly when there are issues or delays with DNS resolution in the network environment. By disabling reverse DNS lookups, the traceroute command can display the route path more quickly without waiting for DNS lookups to complete.</p>\n<h2 id=\"examples\">Examples</h2>\n<ul>\n<li>Check the network path to the target computer: <code>traceroute example.com</code></li>\n<li>Use UDP datagrams instead of ICMP echo: <code>traceroute -U example.com</code></li>\n<li>Set the number of packets to send: <code>traceroute -c 5 example.com</code></li>\n<li>Do not resolve IP addresses to hostnames: <code>traceroute -n example.com</code></li>\n<li>Use route tracing instead of ICMP echo request: <code>traceroute -r example.com</code></li>\n</ul>\n"}